---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendData.HookLength1
source: html/cf4d57e1-01af-f37a-c5c7-af38cb263bd9.htm
---
# Autodesk.Revit.DB.Structure.RebarBendData.HookLength1 Property

The extension length of the hook at the end.

## Syntax (C#)
```csharp
public double HookLength1 { get; set; }
```